ManuEngineer/ESP32-Fermentationsschrank/sdkconfig.defaults
# Reproduzierbare Startwerte fuer die ESP-IDF-6.1-Buildbasis (Issue #159).
# Kein Bring-up-/CI-/Release-Overlay: #72 besitzt noch keine reale
# funktionale Kconfig-Differenz zwischen diesen Stufen (siehe
# docs/tasks/issue-72-implementation-plan.md, Abschnitt 6).

# ESP32-WROOM-32E, passend zu platformio.ini board=esp32dev.
CONFIG_IDF_TARGET="esp32"

# Release 1 zielt auf exakt 4 MB Flash (siehe AGENTS.md, app_config.hpp).
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Issue #90 production partition layout. The bring-up-only harness selects an
# alternative label for the same physical state-store flash range; it is not
# a physically separate test partition.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions/issue_90_state_store.csv"

# Measured Release-1 main-task baseline; keep this shared across profiles.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Kein PSRAM-Eintrag: CONFIG_SPIRAM ist im ESP-IDF-Default bereits
# deaktiviert; Release 1 darf keine PSRAM-Abhaengigkeit einfuehren.
# Issue #31 raw-touch contract: conversion/calibration remains above the
# controller adapter boundary.
CONFIG_XPT2046_CONVERT_ADC_TO_COORDS=n
